Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP16GS502.h
/* ADTRIG3 */
#define _TRGSRC4 ADTRIG3bits.TRGSRC4
#define _TRGSRC5 ADTRIG3bits.TRGSRC5
#define _TRGSRC40 ADTRIG3bits.TRGSRC40
#define _TRGSRC41 ADTRIG3bits.TRGSRC41
#define _TRGSRC42 ADTRIG3bits.TRGSRC42
#define _TRGSRC43 ADTRIG3bits.TRGSRC43
#define _TRGSRC44 ADTRIG3bits.TRGSRC44
#define _TRGSRC50 ADTRIG3bits.TRGSRC50
#define _TRGSRC51 ADTRIG3bits.TRGSRC51
#define _TRGSRC52 ADTRIG3bits.TRGSRC52
#define _TRGSRC53 ADTRIG3bits.TRGSRC53
#define _TRGSRC54 ADTRIG3bits.TRGSRC54

/* ADTRIG4 */
#define _TRGSRC6 ADTRIG4bits.TRGSRC6
#define _TRGSRC7 ADTRIG4bits.TRGSRC7
#define _TRGSRC60 ADTRIG4bits.TRGSRC60
#define _TRGSRC61 ADTRIG4bits.TRGSRC61
#define _TRGSRC62 ADTRIG4bits.TRGSRC62
#define _TRGSRC63 ADTRIG4bits.TRGSRC63
#define _TRGSRC64 ADTRIG4bits.TRGSRC64
#define _TRGSRC70 ADTRIG4bits.TRGSRC70
#define _TRGSRC71 ADTRIG4bits.TRGSRC71
#define _TRGSRC72 ADTRIG4bits.TRGSRC72
#define _TRGSRC73 ADTRIG4bits.TRGSRC73
#define _TRGSRC74 ADTRIG4bits.TRGSRC74

/* ADTRIG9 */
#define _TRGSRC17 ADTRIG9bits.TRGSRC17
#define _TRGSRC170 ADTRIG9bits.TRGSRC170
#define _TRGSRC171 ADTRIG9bits.TRGSRC171
#define _TRGSRC172 ADTRIG9bits.TRGSRC172
#define _TRGSRC173 ADTRIG9bits.TRGSRC173
#define _TRGSRC174 ADTRIG9bits.TRGSRC174

/* ADTRIG10 */
#define _TRGSRC18 ADTRIG10bits.TRGSRC18
#define _TRGSRC19 ADTRIG10bits.TRGSRC19
#define _TRGSRC180 ADTRIG10bits.TRGSRC180
#define _TRGSRC181 ADTRIG10bits.TRGSRC181
#define _TRGSRC182 ADTRIG10bits.TRGSRC182
#define _TRGSRC183 ADTRIG10bits.TRGSRC183
#define _TRGSRC184 ADTRIG10bits.TRGSRC184
#define _TRGSRC190 ADTRIG10bits.TRGSRC190
#define _TRGSRC191 ADTRIG10bits.TRGSRC191
#define _TRGSRC192 ADTRIG10bits.TRGSRC192
#define _TRGSRC193 ADTRIG10bits.TRGSRC193
#define _TRGSRC194 ADTRIG10bits.TRGSRC194

/* ADTRIG11 */
/* Bitname _TRGSRC20 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC21 cannot be defined because it is used by more than one SFR */
#define _TRGSRC200 ADTRIG11bits.TRGSRC200
#define _TRGSRC201 ADTRIG11bits.TRGSRC201
#define _TRGSRC202 ADTRIG11bits.TRGSRC202
#define _TRGSRC203 ADTRIG11bits.TRGSRC203
#define _TRGSRC204 ADTRIG11bits.TRGSRC204
#define _TRGSRC210 ADTRIG11bits.TRGSRC210
#define _TRGSRC211 ADTRIG11bits.TRGSRC211
#define _TRGSRC212 ADTRIG11bits.TRGSRC212
#define _TRGSRC213 ADTRIG11bits.TRGSRC213
#define _TRGSRC214 ADTRIG11bits.TRGSRC214

/* ADTRIG13 */
#define _TRGSRC25 ADTRIG13bits.TRGSRC25
#define _TRGSRC250 ADTRIG13bits.TRGSRC250
#define _TRGSRC251 ADTRIG13bits.TRGSRC251
#define _TRGSRC252 ADTRIG13bits.TRGSRC252
#define _TRGSRC253 ADTRIG13bits.TRGSRC253
#define _TRGSRC254 ADTRIG13bits.TRGSRC254

/* ADTRIG14 */
#define _TRGSRC26 ADTRIG14bits.TRGSRC26
#define _TRGSRC260 ADTRIG14bits.TRGSRC260
#define _TRGSRC261 ADTRIG14bits.TRGSRC261
#define _TRGSRC262 ADTRIG14bits.TRGSRC262
#define _TRGSRC263 ADTRIG14bits.TRGSRC263
#define _TRGSRC264 ADTRIG14bits.TRGSRC264

/* DCMP1CON */
/* Bitname _IELOLO cannot be defined because it is used by more than one SFR */
/* Bitname _IELOHI cannot be defined because it is used by more than one SFR */
/* Bitname _IEHILO cannot be defined because it is used by more than one SFR */
/* Bitname _IEHIHI cannot be defined because it is used by more than one SFR */
/* Bitname _IEBTWN cannot be defined because it is used by more than one SFR */
/* Bitname _DCMPED cannot be defined because it is used by more than one SFR */
/* Bitname _DCMPGIEN cannot be defined because it is used by more than one SFR */
/* Bitname _DCMPEN cannot be defined because it is used by more than one SFR */
/* Bitname _AINID cannot be defined because it is used by more than one SFR */
/* Bitname _AINID0 cannot be defined because it is used by more than one SFR */
/* Bitname _AINID1 cannot be defined because it is used by more than one SFR */
/* Bitname _AINID2 cannot be defined because it is used by more than one SFR */
/* Bitname _AINID3 cannot be defined because it is used by more than one SFR */
/* Bitname _AINID4 cannot be defined because it is used by more than one SFR */

/* DCMP2CON */
/* Bitname _IELOLO cannot be defined because it is used by more than one SFR */
/* Bitname _IELOHI cannot be defined because it is used by more than one SFR */
/* Bitname _IEHILO cannot be defined because it is used by more than one SFR */
/* Bitname _IEHIHI cannot be defined because it is used by more than one SFR */
/* Bitname _IEBTWN cannot be defined because it is used by more than one SFR */
/* Bitname _DCMPED cannot be defined because it is used by more than one SFR */
/* Bitname _DCMPGIEN cannot be defined because it is used by more than one SFR */
/* Bitname _DCMPEN cannot be defined because it is used by more than one SFR */
/* Bitname _AINID cannot be defined because it is used by more than one SFR */
/* Bitname _AINID0 cannot be defined because it is used by more than one SFR */
/* Bitname _AINID1 cannot be defined because it is used by more than one SFR */
/* Bitname _AINID2 cannot be defined because it is used by more than one SFR */
/* Bitname _AINID3 cannot be defined because it is used by more than one SFR */
/* Bitname _AINID4 cannot be defined because it is used by more than one SFR */

/* ISRCCON */
#define _ISRCCAL ISRCCONbits.ISRCCAL
#define _OUTSEL ISRCCONbits.OUTSEL
#define _ISRCEN ISRCCONbits.ISRCEN
#define _ISRCCAL0 ISRCCONbits.ISRCCAL0
#define _ISRCCAL1 ISRCCONbits.ISRCCAL1
#define _ISRCCAL2 ISRCCONbits.ISRCCAL2
#define _ISRCCAL3 ISRCCONbits.ISRCCAL3
#define _ISRCCAL4 ISRCCONbits.ISRCCAL4
#define _ISRCCAL5 ISRCCONbits.ISRCCAL5
#define _OUTSEL0 ISRCCONbits.OUTSEL0
#define _OUTSEL1 ISRCCONbits.OUTSEL1
#define _OUTSEL2 ISRCCONbits.OUTSEL2

/* PGA1CON */
/* Bitname _GAIN cannot be defined because it is used by more than one SFR */
/* Bitname _SELNI cannot be defined because it is used by more than one SFR */
/* Bitname _SELPI cannot be defined because it is used by more than one SFR */
/* Bitname _PGAOEN cannot be defined because it is used by more than one SFR */
/* Bitname _PGAEN cannot be defined because it is used by more than one SFR */
/* Bitname _GAIN0 cannot be defined because it is used by more than one SFR */
/* Bitname _GAIN1 cannot be defined because it is used by more than one SFR */
/* Bitname _GAIN2 cannot be defined because it is used by more than one SFR */
/* Bitname _SELNI0 cannot be defined because it is used by more than one SFR */
/* Bitname _SELNI1 cannot be defined because it is used by more than one SFR */
/* Bitname _SELNI2 cannot be defined because it is used by more than one SFR */
/* Bitname _SELPI0 cannot be defined because it is used by more than one SFR */
/* Bitname _SELPI1 cannot be defined because it is used by more than one SFR */
/* Bitname _SELPI2 cannot be defined because it is used by more than one SFR */

