Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP16GS502.h
#define _ADCON4_ADCRDY_POSITION                  0x0000000F
#define _ADCON4_ADCRDY_MASK                      0x00008000
#define _ADCON4_ADCRDY_LENGTH                    0x00000001

#define _ADCON4_SAMC0_POSITION                   0x00000000
#define _ADCON4_SAMC0_MASK                       0x00000001
#define _ADCON4_SAMC0_LENGTH                     0x00000001

#define _ADCON4_SAMC1_POSITION                   0x00000001
#define _ADCON4_SAMC1_MASK                       0x00000002
#define _ADCON4_SAMC1_LENGTH                     0x00000001

#define _ADCON4_SAMC2_POSITION                   0x00000002
#define _ADCON4_SAMC2_MASK                       0x00000004
#define _ADCON4_SAMC2_LENGTH                     0x00000001

#define _ADCON4_SAMC3_POSITION                   0x00000003
#define _ADCON4_SAMC3_MASK                       0x00000008
#define _ADCON4_SAMC3_LENGTH                     0x00000001

#define _ADCON4_SAMC4_POSITION                   0x00000004
#define _ADCON4_SAMC4_MASK                       0x00000010
#define _ADCON4_SAMC4_LENGTH                     0x00000001

#define _ADCON4_SAMC5_POSITION                   0x00000005
#define _ADCON4_SAMC5_MASK                       0x00000020
#define _ADCON4_SAMC5_LENGTH                     0x00000001

#define _ADCON4_SAMC6_POSITION                   0x00000006
#define _ADCON4_SAMC6_MASK                       0x00000040
#define _ADCON4_SAMC6_LENGTH                     0x00000001

#define _ADCON4_SAMC7_POSITION                   0x00000007
#define _ADCON4_SAMC7_MASK                       0x00000080
#define _ADCON4_SAMC7_LENGTH                     0x00000001

#define _ADCON5_ADINSEL_POSITION                 0x00000000
#define _ADCON5_ADINSEL_MASK                     0x0000003F
#define _ADCON5_ADINSEL_LENGTH                   0x00000006

#define _ADCON5_VREFSEL_POSITION                 0x0000000A
#define _ADCON5_VREFSEL_MASK                     0x00001C00
#define _ADCON5_VREFSEL_LENGTH                   0x00000003

#define _ADCON5_ADINSEL0_POSITION                0x00000000
#define _ADCON5_ADINSEL0_MASK                    0x00000001
#define _ADCON5_ADINSEL0_LENGTH                  0x00000001

#define _ADCON5_ADINSEL1_POSITION                0x00000001
#define _ADCON5_ADINSEL1_MASK                    0x00000002
#define _ADCON5_ADINSEL1_LENGTH                  0x00000001

#define _ADCON5_ADINSEL2_POSITION                0x00000002
#define _ADCON5_ADINSEL2_MASK                    0x00000004
#define _ADCON5_ADINSEL2_LENGTH                  0x00000001

#define _ADCON5_ADINSEL3_POSITION                0x00000003
#define _ADCON5_ADINSEL3_MASK                    0x00000008
#define _ADCON5_ADINSEL3_LENGTH                  0x00000001

#define _ADCON5_ADINSEL4_POSITION                0x00000004
#define _ADCON5_ADINSEL4_MASK                    0x00000010
#define _ADCON5_ADINSEL4_LENGTH                  0x00000001

#define _ADCON5_ADINSEL5_POSITION                0x00000005
#define _ADCON5_ADINSEL5_MASK                    0x00000020
#define _ADCON5_ADINSEL5_LENGTH                  0x00000001

#define _ADCON5_VREFSEL0_POSITION                0x0000000A
#define _ADCON5_VREFSEL0_MASK                    0x00000400
#define _ADCON5_VREFSEL0_LENGTH                  0x00000001

#define _ADCON5_VREFSEL1_POSITION                0x0000000B
#define _ADCON5_VREFSEL1_MASK                    0x00000800
#define _ADCON5_VREFSEL1_LENGTH                  0x00000001

#define _ADCON5_VREFSEL2_POSITION                0x0000000C
#define _ADCON5_VREFSEL2_MASK                    0x00001000
#define _ADCON5_VREFSEL2_LENGTH                  0x00000001

#define _ADCON6_RQCONVRT_POSITION                0x0000000D
#define _ADCON6_RQCONVRT_MASK                    0x00002000
#define _ADCON6_RQCONVRT_LENGTH                  0x00000001

#define _ADCON6_GSWTRG_POSITION                  0x0000000E
#define _ADCON6_GSWTRG_MASK                      0x00004000
#define _ADCON6_GSWTRG_LENGTH                    0x00000001

#define _ADCON6_CAL_POSITION                     0x0000000F
#define _ADCON6_CAL_MASK                         0x00008000
#define _ADCON6_CAL_LENGTH                       0x00000001

#define _ADMOD_SH0MOD_POSITION                   0x00000000
#define _ADMOD_SH0MOD_MASK                       0x00000003
#define _ADMOD_SH0MOD_LENGTH                     0x00000002

#define _ADMOD_SH1MOD_POSITION                   0x00000002
#define _ADMOD_SH1MOD_MASK                       0x0000000C
#define _ADMOD_SH1MOD_LENGTH                     0x00000002

#define _ADMOD_SH2MOD_POSITION                   0x00000004
#define _ADMOD_SH2MOD_MASK                       0x00000030
#define _ADMOD_SH2MOD_LENGTH                     0x00000002

#define _ADMOD_SH3MOD_POSITION                   0x00000006
#define _ADMOD_SH3MOD_MASK                       0x000000C0
#define _ADMOD_SH3MOD_LENGTH                     0x00000002

#define _ADMOD_SH4MOD_POSITION                   0x00000008
#define _ADMOD_SH4MOD_MASK                       0x00000300
#define _ADMOD_SH4MOD_LENGTH                     0x00000002

#define _ADMOD_SH0MOD0_POSITION                  0x00000000
#define _ADMOD_SH0MOD0_MASK                      0x00000001
#define _ADMOD_SH0MOD0_LENGTH                    0x00000001

#define _ADMOD_SH0MOD1_POSITION                  0x00000001
#define _ADMOD_SH0MOD1_MASK                      0x00000002
#define _ADMOD_SH0MOD1_LENGTH                    0x00000001

#define _ADMOD_SH1MOD0_POSITION                  0x00000002
#define _ADMOD_SH1MOD0_MASK                      0x00000004
#define _ADMOD_SH1MOD0_LENGTH                    0x00000001

#define _ADMOD_SH1MOD1_POSITION                  0x00000003
#define _ADMOD_SH1MOD1_MASK                      0x00000008
#define _ADMOD_SH1MOD1_LENGTH                    0x00000001

#define _ADMOD_SH2MOD0_POSITION                  0x00000004
#define _ADMOD_SH2MOD0_MASK                      0x00000010
#define _ADMOD_SH2MOD0_LENGTH                    0x00000001

#define _ADMOD_SH2MOD1_POSITION                  0x00000005
#define _ADMOD_SH2MOD1_MASK                      0x00000020
#define _ADMOD_SH2MOD1_LENGTH                    0x00000001

